<h1>ANOVOS - Statistic Generator<span class="tocSkip"></span></h1>
<p> Following notebook shows the list of functions related to "stats generator" module provided under ANOVOS package and how it can be invoked accordingly</p>
<div class="toc"><ul class="toc-item"><li><span><a href="#Global-Summary" data-toc-modified-id="Global-Summary-1">Global Summary</a></span></li><li><span><a href="#Measures-of-Counts" data-toc-modified-id="Measures-of-Counts-2">Measures of Counts</a></span></li><li><span><a href="#Measures-of-Central-Tendency" data-toc-modified-id="Measures-of-Central-Tendency-3">Measures of Central Tendency</a></span></li><li><span><a href="#Measures-of-Cardinality" data-toc-modified-id="Measures-of-Cardinality-4">Measures of Cardinality</a></span></li><li><span><a href="#Measures-of-Dispersion" data-toc-modified-id="Measures-of-Dispersion-5">Measures of Dispersion</a></span></li><li><span><a href="#Measures-of-Percentiles" data-toc-modified-id="Measures-of-Percentiles-6">Measures of Percentiles</a></span></li><li><span><a href="#Measures-of-Shape" data-toc-modified-id="Measures-of-Shape-7">Measures of Shape</a></span></li></ul></div>

**Setting Spark Session**

In [1]:
from anovos.shared.spark import *

**Input/Output Path**

In [2]:
inputPath = "../data/income_dataset/csv"
outputPath = "../output/income_dataset/data_analyzer"

In [3]:
from anovos.data_ingest.data_ingest import read_dataset

In [4]:
df = read_dataset(spark, file_path = inputPath, file_type = "csv",file_configs = {"header": "True", 
                                                                           "delimiter": "," , 
                                                                           "inferSchema": "True"})
df.toPandas().head(5)

,ifa,age,workclass,fnlwgt,logfnl,empty,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,1a,NaN,State-gov,77516.0,4.889391,None,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,UnitedStates,<=50K
1,2a,NaN,Self-emp-not-inc,83311.0,4.920702,None,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,UnitedStates,<=50K
2,3a,38.0,Private,215646.0,5.333741,None,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0.0,40.0,UnitedStates,<=50K
3,4a,53.0,Private,234721.0,5.370552,None,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,UnitedStates,<=50K
4,5a,NaN,Private,338409.0,5.529442,None,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0.0,40.0,Cuba,<=50K

# Global Summary
- API specification of function **global_summary** can be found <a href="../api_specification/anovos/data_analyzer/stats_generator.html#anovos.data_analyzer.stats_generator.global_summary">here</a>

In [5]:
from anovos.data_analyzer.stats_generator import global_summary

In [6]:
# Example 1 - with manadatory arguments (rest arguments have default values)
odf = global_summary(spark, df)
odf.toPandas()

No. of Rows: 32,561
No. of Columns: 18
Numerical Columns: 7
['fnlwgt', 'hours-per-week', 'capital-loss', 'education-num', 'logfnl', 'capital-gain', 'age']
Categorical Columns: 11
['workclass', 'race', 'relationship', 'native-country', 'income', 'sex', 'occupation', 'education', 'ifa', 'marital-status', 'empty']

            metric                                              value
0       rows_count                                              32561
1    columns_count                                                 18
2    numcols_count                                                  7
3     numcols_name  fnlwgt, hours-per-week, capital-loss, educatio...
4    catcols_count                                                 11
5     catcols_name  workclass, race, relationship, native-country,...
6  othercols_count                                                  0
7   othercols_name

In [7]:
# Example 2 - 'all' columns (excluding drop_cols)
odf = global_summary(spark, idf = df, list_of_cols='all', drop_cols=['ifa'])
odf.toPandas()

No. of Rows: 32,561
No. of Columns: 17
Numerical Columns: 7
['fnlwgt', 'hours-per-week', 'capital-loss', 'education-num', 'logfnl', 'capital-gain', 'age']
Categorical Columns: 10
['workclass', 'race', 'relationship', 'native-country', 'income', 'sex', 'occupation', 'education', 'marital-status', 'empty']

            metric                                              value
0       rows_count                                              32561
1    columns_count                                                 17
2    numcols_count                                                  7
3     numcols_name  fnlwgt, hours-per-week, capital-loss, educatio...
4    catcols_count                                                 10
5     catcols_name  workclass, race, relationship, native-country,...
6  othercols_count                                                  0
7   othercols_name

In [8]:
# Example 3 - selected columns
odf = global_summary(spark, idf = df, list_of_cols= ['age','sex','race','workclass','fnlwgt'])
odf.toPandas()

No. of Rows: 32,561
No. of Columns: 5
Numerical Columns: 2
['fnlwgt', 'age']
Categorical Columns: 3
['workclass', 'race', 'sex']

            metric                 value
0       rows_count                 32561
1    columns_count                     5
2    numcols_count                     2
3     numcols_name           fnlwgt, age
4    catcols_count                     3
5     catcols_name  workclass, race, sex
6  othercols_count                     0
7   othercols_name

# Measures of Counts

- API specification of function **measures_of_counts** can be found <a href="../api_specification/anovos/data_analyzer/stats_generator.html#anovos.data_analyzer.stats_generator.measures_of_counts">here</a>
- Non zero count/% calculated only for numerical columns

In [9]:
from anovos.data_analyzer.stats_generator import measures_of_counts, nonzeroCount_computation

In [10]:
# Example 1 - with manadatory arguments (rest arguments have default values)
odf = measures_of_counts(spark, df)
odf.toPandas()

,attribute,fill_count,fill_pct,missing_count,missing_pct,nonzero_count,nonzero_pct
0,ifa,32561,1.0000,0,0.0000,NaN,NaN
1,education-num,32530,0.9990,31,0.0010,32530.0,0.9990
2,workclass,32558,0.9999,3,0.0001,NaN,NaN
3,education,32040,0.9840,521,0.0160,NaN,NaN
4,race,32247,0.9904,314,0.0096,NaN,NaN
5,relationship,32557,0.9999,4,0.0001,NaN,NaN
6,capital-gain,32548,0.9996,13,0.0004,2710.0,0.0832
7,capital-loss,32549,0.9996,12,0.0004,1519.0,0.0467
8,income,32561,1.0000,0,0.0000,NaN,NaN
9,age,32500,0.9981,61,0.0019,32500.0,0.9981
10,hours-per-week,32452,0.9967,109,0.0033,32452.0,0.9967
11,fnlwgt,32546,0.9995,15,0.0005,32546.0,0.9995
12,native-country,32561,1.0000,0,0.0000,NaN,NaN
13,marital-status,32135,0.9869,426,0.0131,NaN,NaN
14,sex,32557,0.9999,4,0.0001,NaN,NaN
15,occupation,32549,0.9996,12,0.0004,NaN,NaN
16,logfnl,12168,0.3737,20393,0.6263,12168.0,0.3737
17,empty,0,0.0000,32561,1.0000,NaN,NaN

In [11]:
# Example 2 - 'all' columns (excluding drop_cols)
odf = measures_of_counts(spark, idf = df, list_of_cols='all', drop_cols=['ifa'])
odf.toPandas()

,attribute,fill_count,fill_pct,missing_count,missing_pct,nonzero_count,nonzero_pct
0,education-num,32530,0.9990,31,0.0010,32530.0,0.9990
1,workclass,32558,0.9999,3,0.0001,NaN,NaN
2,education,32040,0.9840,521,0.0160,NaN,NaN
3,race,32247,0.9904,314,0.0096,NaN,NaN
4,relationship,32557,0.9999,4,0.0001,NaN,NaN
5,capital-gain,32548,0.9996,13,0.0004,2710.0,0.0832
6,capital-loss,32549,0.9996,12,0.0004,1519.0,0.0467
7,income,32561,1.0000,0,0.0000,NaN,NaN
8,age,32500,0.9981,61,0.0019,32500.0,0.9981
9,hours-per-week,32452,0.9967,109,0.0033,32452.0,0.9967
10,fnlwgt,32546,0.9995,15,0.0005,32546.0,0.9995
11,native-country,32561,1.0000,0,0.0000,NaN,NaN
12,marital-status,32135,0.9869,426,0.0131,NaN,NaN
13,sex,32557,0.9999,4,0.0001,NaN,NaN
14,occupation,32549,0.9996,12,0.0004,NaN,NaN
15,logfnl,12168,0.3737,20393,0.6263,12168.0,0.3737
16,empty,0,0.0000,32561,1.0000,NaN,NaN

In [12]:
# Example 3 - selected columns
odf = measures_of_counts(spark, idf = df, list_of_cols= ['age','sex','race','workclass','fnlwgt'])
odf.toPandas()

,attribute,fill_count,fill_pct,missing_count,missing_pct,nonzero_count,nonzero_pct
0,workclass,32558,0.9999,3,0.0001,NaN,NaN
1,race,32247,0.9904,314,0.0096,NaN,NaN
2,age,32500,0.9981,61,0.0019,32500.0,0.9981
3,fnlwgt,32546,0.9995,15,0.0005,32546.0,0.9995
4,sex,32557,0.9999,4,0.0001,NaN,NaN

In [13]:
# Example 4 - only numerical columns
odf = measures_of_counts(spark, idf = df, list_of_cols= ['age','education-num','capital-gain'])
odf.toPandas()

,attribute,fill_count,fill_pct,missing_count,missing_pct,nonzero_count,nonzero_pct
0,education-num,32530,0.9990,31,0.0010,32530,0.9990
1,capital-gain,32548,0.9996,13,0.0004,2710,0.0832
2,age,32500,0.9981,61,0.0019,32500,0.9981

In [14]:
# Example 5 - only categorical columns (user warning is shown as nonon-zero computation didn't happen due to absence of any numerical column)
odf = measures_of_counts(spark, idf = df, list_of_cols= ['sex','race','workclass'])
odf.toPandas()

/Users/chensinuo/anaconda3/envs/py3/lib/python3.7/site-packages/anovos/data_analyzer/stats_generator.py:132: UserWarning: No Non-Zero Count Computation
  warnings.warn("No Non-Zero Count Computation")

,attribute,fill_count,fill_pct,missing_count,missing_pct,nonzero_count,nonzero_pct
0,workclass,32558,0.9999,3,0.0001,None,None
1,race,32247,0.9904,314,0.0096,None,None
2,sex,32557,0.9999,4,0.0001,None,None

# Measures of Central Tendency

- API specification of function **measures_of_centralTendency** can be found <a href="../api_specification/anovos/data_analyzer/stats_generator.html#anovos.data_analyzer.stats_generator.measures_of_centralTendency">here</a>
- Mode & Mode% calculated only for discrete columns (string + integer datatypes)

In [15]:
from anovos.data_analyzer.stats_generator import measures_of_centralTendency

In [16]:
# Example 1 - with manadatory arguments (rest arguments have default values)
odf = measures_of_centralTendency(spark, df)
odf.toPandas()

         attribute         mean       median                mode  mode_pct
0              ifa          NaN          NaN                 99a    0.0000
1    education-num      10.0810      10.0000                   9    0.3225
2        workclass          NaN          NaN             Private    0.6968
3        education          NaN          NaN             HS-grad    0.3274
4             race          NaN          NaN               White    0.8618
5     relationship          NaN          NaN             Husband    0.4050
6     capital-gain    1077.6960       0.0000                   0    0.9167
7     capital-loss      87.3360       0.0000                   0    0.9533
8           income          NaN          NaN               <=50K    0.7592
9              age      38.5065      37.0000                  36    0.0276
10  hours-per-week      40.2497      40.0000                  40    0.4688
11          fnlwgt  189781.8318  178353.0000              164190    0.0004
12  native-country          NaN          NaN       United-States    0.8957
13  marital-status          NaN          NaN  Married-civ-spouse    0.4654
14             sex          NaN          NaN                Male    0.6691
15      occupation          NaN          NaN      Prof-specialty    0.1271
16          logfnl       5.2055       5.2524                None       NaN
17           empty          NaN          NaN                None       NaN

In [17]:
# Example 2 - 'all' columns (excluding drop_cols)
odf = measures_of_centralTendency(spark, idf = df, list_of_cols='all', drop_cols=['ifa'])
odf.toPandas()

         attribute         mean       median                mode  mode_pct
0    education-num      10.0810      10.0000                   9    0.3225
1        workclass          NaN          NaN             Private    0.6968
2        education          NaN          NaN             HS-grad    0.3274
3             race          NaN          NaN               White    0.8618
4     relationship          NaN          NaN             Husband    0.4050
5     capital-gain    1077.6960       0.0000                   0    0.9167
6     capital-loss      87.3360       0.0000                   0    0.9533
7           income          NaN          NaN               <=50K    0.7592
8              age      38.5065      37.0000                  36    0.0276
9   hours-per-week      40.2497      40.0000                  40    0.4688
10          fnlwgt  189781.8318  178353.0000              164190    0.0004
11  native-country          NaN          NaN       United-States    0.8957
12  marital-status          NaN          NaN  Married-civ-spouse    0.4654
13             sex          NaN          NaN                Male    0.6691
14      occupation          NaN          NaN      Prof-specialty    0.1271
15          logfnl       5.2055       5.2524                None       NaN
16           empty          NaN          NaN                None       NaN

In [18]:
# Example 3 - selected columns
odf = measures_of_centralTendency(spark, idf = df, list_of_cols= ['age','sex','race','workclass','fnlwgt'])
odf.toPandas()

   attribute         mean    median     mode  mode_pct
0  workclass          NaN       NaN  Private    0.6968
1       race          NaN       NaN    White    0.8618
2        age      38.5065      37.0       36    0.0276
3     fnlwgt  189781.8318  178353.0   164190    0.0004
4        sex          NaN       NaN     Male    0.6691

In [19]:
# Example 4 - only numerical columns
odf = measures_of_centralTendency(spark, idf = df, list_of_cols= ['age','education-num','capital-gain','logfnl'])
odf.toPandas()

       attribute       mean   median  mode  mode_pct
0  education-num    10.0810  10.0000     9    0.3225
1   capital-gain  1077.6960   0.0000     0    0.9167
2            age    38.5065  37.0000    36    0.0276
3         logfnl     5.2055   5.2524  None       NaN

In [20]:
# Example 5 - only categorical columns
odf = measures_of_centralTendency(spark, idf = df, list_of_cols= ['sex','race','workclass'])
odf.toPandas()

   attribute  mean median     mode  mode_pct
0  workclass  None   None  Private    0.6968
1       race  None   None    White    0.8618
2        sex  None   None     Male    0.6691

# Measures of Cardinality

- API specification of function **measures_of_cardinality** can be found <a href="../api_specification/anovos/data_analyzer/stats_generator.html#anovos.data_analyzer.stats_generator.measures_of_cardinality">here</a>
- Calculated only for discrete columns (string + integer datatypes)

In [21]:
from anovos.data_analyzer.stats_generator import measures_of_cardinality

In [22]:
# Example 1 - with manadatory arguments (rest arguments have default values)
odf = measures_of_cardinality(spark, df)
odf.toPandas()

         attribute  unique_values  IDness
0              ifa          32561  1.0000
1    education-num             16  0.0005
2        workclass             11  0.0003
3        education             16  0.0005
4             race              9  0.0003
5     relationship              8  0.0002
6     capital-gain            119  0.0037
7     capital-loss             92  0.0028
8           income              2  0.0001
9              age             69  0.0021
10  hours-per-week             89  0.0027
11          fnlwgt          21640  0.6649
12  native-country             44  0.0014
13  marital-status              7  0.0002
14             sex              3  0.0001
15      occupation             15  0.0005
16           empty              0     NaN

In [23]:
# Example 2 - 'all' columns (excluding drop_cols)
odf = measures_of_cardinality(spark, idf = df, list_of_cols='all', drop_cols=['ifa'])
odf.toPandas()

         attribute  unique_values  IDness
0    education-num             16  0.0005
1        workclass             11  0.0003
2        education             16  0.0005
3             race              9  0.0003
4     relationship              8  0.0002
5     capital-gain            119  0.0037
6     capital-loss             92  0.0028
7           income              2  0.0001
8              age             69  0.0021
9   hours-per-week             89  0.0027
10          fnlwgt          21640  0.6649
11  native-country             44  0.0014
12  marital-status              7  0.0002
13             sex              3  0.0001
14      occupation             15  0.0005
15           empty              0     NaN

In [24]:
# Example 3 - selected columns
odf = measures_of_cardinality(spark, idf = df, list_of_cols= ['age','sex','race','workclass','fnlwgt'])
odf.toPandas()

   attribute  unique_values  IDness
0  workclass             11  0.0003
1       race              9  0.0003
2        age             69  0.0021
3     fnlwgt          21640  0.6649
4        sex              3  0.0001

In [25]:
# Example 4 - only numerical columns
odf = measures_of_cardinality(spark, idf = df, list_of_cols= ['age','education-num','capital-gain','logfnl'])
odf.toPandas()

       attribute  unique_values  IDness
0  education-num             16  0.0005
1   capital-gain            119  0.0037
2            age             69  0.0021
3         logfnl          10036  0.8248

In [26]:
# Example 5 - only categorical columns
odf = measures_of_cardinality(spark, idf = df, list_of_cols= ['sex','race','workclass'])
odf.toPandas()

   attribute  unique_values  IDness
0  workclass             11  0.0003
1       race              9  0.0003
2        sex              3  0.0001

# Measures of Dispersion

- API specification of function **measures_of_dispersion** can be found <a href="../api_specification/anovos/data_analyzer/stats_generator.html#anovos.data_analyzer.stats_generator.measures_of_dispersion">here</a>
- Supports only numerical columns

In [27]:
from anovos.data_analyzer.stats_generator import measures_of_dispersion

In [28]:
# Example 1 - with manadatory arguments (rest arguments have default values)
odf = measures_of_dispersion(spark, df)
odf.toPandas()

,attribute,stddev,variance,cov,IQR,range
0,education-num,2.5725,6.617800e+00,0.2552,3.0000,1.500000e+01
1,capital-gain,7386.6249,5.456223e+07,6.8541,0.0000,9.999900e+04
2,capital-loss,403.0310,1.624340e+05,4.6147,0.0000,4.356000e+03
3,age,13.5085,1.824796e+02,0.3508,20.0000,6.800000e+01
4,hours-per-week,11.9143,1.419505e+02,0.2960,5.0000,9.300000e+01
5,fnlwgt,105563.0645,1.114356e+10,0.5562,119159.0000,1.472420e+06
6,logfnl,0.2742,7.520000e-02,0.0527,0.3052,1.805100e+00

In [29]:
# Example 2 - 'all' columns (excluding drop_cols)
odf = measures_of_dispersion(spark, idf = df, list_of_cols='all', drop_cols=['capital-loss'])
odf.toPandas()

,attribute,stddev,variance,cov,IQR,range
0,education-num,2.5725,6.617800e+00,0.2552,3.0000,1.500000e+01
1,capital-gain,7386.6249,5.456223e+07,6.8541,0.0000,9.999900e+04
2,age,13.5085,1.824796e+02,0.3508,20.0000,6.800000e+01
3,hours-per-week,11.9143,1.419505e+02,0.2960,5.0000,9.300000e+01
4,fnlwgt,105563.0645,1.114356e+10,0.5562,119159.0000,1.472420e+06
5,logfnl,0.2742,7.520000e-02,0.0527,0.3052,1.805100e+00

In [30]:
# Example 3 - selected numerical columns
odf = measures_of_dispersion(spark, idf = df, list_of_cols= ['age','education-num','capital-gain','logfnl'])
odf.toPandas()

       attribute     stddev      variance     cov      IQR       range
0  education-num     2.5725  6.617800e+00  0.2552   3.0000     15.0000
1   capital-gain  7386.6249  5.456223e+07  6.8541   0.0000  99999.0000
2            age    13.5085  1.824796e+02  0.3508  20.0000     68.0000
3         logfnl     0.2742  7.520000e-02  0.0527   0.3052      1.8051

# Measures of Percentiles

- API specification of function **measures_of_percentiles** can be found <a href="../api_specification/anovos/data_analyzer/stats_generator.html#anovos.data_analyzer.stats_generator.measures_of_percentiles">here</a>
- Supports only numerical columns

In [31]:
from anovos.data_analyzer.stats_generator import measures_of_percentiles

In [32]:
# Example 1 - with manadatory arguments (rest arguments have default values)
odf = measures_of_percentiles(spark, df)
odf.toPandas()

,attribute,min,1%,5%,10%,25%,50%,75%,90%,95%,99%,max
0,education-num,1.0000,3.0000,5.0000,7.0000,9.0000,10.0000,12.0000,13.0000,14.0000,16.0000,1.600000e+01
1,capital-gain,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,5013.0000,15024.0000,9.999900e+04
2,capital-loss,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1980.0000,4.356000e+03
3,age,17.0000,17.0000,19.0000,22.0000,28.0000,37.0000,48.0000,58.0000,63.0000,73.0000,8.500000e+01
4,hours-per-week,1.0000,8.0000,18.0000,24.0000,40.0000,40.0000,45.0000,55.0000,60.0000,72.0000,9.400000e+01
5,fnlwgt,12285.0000,27162.0000,39388.0000,65624.0000,117833.0000,178353.0000,236992.0000,329026.0000,379522.0000,509866.0000,1.484705e+06
6,logfnl,4.2836,4.4322,4.5937,4.8203,5.0729,5.2524,5.3781,5.5178,5.5768,5.7073,6.088700e+00

In [33]:
# Example 2 - 'all' columns (excluding drop_cols)
odf = measures_of_percentiles(spark, idf = df, list_of_cols='all', drop_cols=['capital-gain'])
odf.toPandas()

,attribute,min,1%,5%,10%,25%,50%,75%,90%,95%,99%,max
0,education-num,1.0000,3.0000,5.0000,7.0000,9.0000,10.0000,12.0000,13.0000,14.0000,16.0000,1.600000e+01
1,capital-loss,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,1980.0000,4.356000e+03
2,age,17.0000,17.0000,19.0000,22.0000,28.0000,37.0000,48.0000,58.0000,63.0000,73.0000,8.500000e+01
3,hours-per-week,1.0000,8.0000,18.0000,24.0000,40.0000,40.0000,45.0000,55.0000,60.0000,72.0000,9.400000e+01
4,fnlwgt,12285.0000,27162.0000,39388.0000,65624.0000,117833.0000,178353.0000,236992.0000,329026.0000,379522.0000,509866.0000,1.484705e+06
5,logfnl,4.2836,4.4322,4.5937,4.8203,5.0729,5.2524,5.3781,5.5178,5.5768,5.7073,6.088700e+00

In [34]:
# Example 3 - selected numerical columns
odf = measures_of_percentiles(spark, idf = df, list_of_cols= ['age','education-num','capital-gain','logfnl'])
odf.toPandas()

,attribute,min,1%,5%,10%,25%,50%,75%,90%,95%,99%,max
0,education-num,1.0000,3.0000,5.0000,7.0000,9.0000,10.0000,12.0000,13.0000,14.0000,16.0000,16.0000
1,capital-gain,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,5013.0000,15024.0000,99999.0000
2,age,17.0000,17.0000,19.0000,22.0000,28.0000,37.0000,48.0000,58.0000,63.0000,73.0000,85.0000
3,logfnl,4.2836,4.4322,4.5937,4.8203,5.0729,5.2524,5.3781,5.5178,5.5768,5.7073,6.0887

# Measures of Shape

- API specification of function **measures_of_shape** can be found <a href="../api_specification/anovos/data_analyzer/stats_generator.html#anovos.data_analyzer.stats_generator.measures_of_shape">here</a>
- Supports only numerical columns

In [35]:
from anovos.data_analyzer.stats_generator import measures_of_shape

In [36]:
# Example 1 - with manadatory arguments (rest arguments have default values)
odf = measures_of_shape(spark, df)
odf.toPandas()

        attribute  skewness  kurtosis
0          fnlwgt    1.4470    6.2170
1  hours-per-week   -0.0756    1.9953
2    capital-loss    4.5935   20.3642
3   education-num   -0.3116    0.6236
4          logfnl   -0.8540    0.8365
5    capital-gain   11.9516  154.7243
6             age    0.5128   -0.3418

In [37]:
# Example 2 - 'all' columns (excluding drop_cols)
odf = measures_of_shape(spark, idf = df, list_of_cols='all', drop_cols=['capital-gain'])
odf.toPandas()

        attribute  skewness  kurtosis
0          fnlwgt    1.4470    6.2170
1  hours-per-week   -0.0756    1.9953
2    capital-loss    4.5935   20.3642
3   education-num   -0.3116    0.6236
4          logfnl   -0.8540    0.8365
5             age    0.5128   -0.3418

In [39]:
# Example 3 - selected numerical columns
odf = measures_of_shape(spark, idf = df, list_of_cols= ['age','education-num','capital-gain','logfnl'])
odf.toPandas()

       attribute  skewness  kurtosis
0  education-num   -0.3116    0.6236
1         logfnl   -0.8540    0.8365
2            age    0.5128   -0.3418
3   capital-gain   11.9516  154.7243